# Note: quotes around formula or cask names are mandatory

# Basic tools
brew 'bash'
brew 'bash-completion@2'
cask 'iterm2'
brew 'tmux'
brew 'reattach-to-user-namespace'
brew 'git'
brew 'jq'
brew 'yq'
brew 'fzf'
brew 'gsed'
brew 'gawk'
brew 'coreutils'
brew 'ripgrep'
brew 'tree'

# Cloud CLIs
brew 'awscli'
brew 'azure-cli'
cask 'google-cloud-sdk'

# Container and DevOps tools
cask 'docker'
brew 'kubernetes-cli'
brew 'terraform'

# Multimedia tools
brew 'imagemagick'
brew 'inkscape'
brew 'ffmpeg'
brew 'gifsicle'
brew 'pdftk-java'
brew 'mupdf-tools'
cask 'vlc'
cask 'gimp'
brew 'grip'

# Miscellaneous apps and tools
cask 'google-chrome'
cask 'google-drive'
cask 'fluor'
