# Notes:
#   - Quotes around formula or cask names are mandatory
#   - Run 'sudo -v' before running this Brewfile in order to prevent
#     interrupting the process by password prompts
#------------------------------------------------------------------------------#

# Known to require root privileges (sudo)
cask 'google-cloud-sdk'

# Basic
cask 'iterm2'
brew 'bash'
brew 'bash-completion@2'
brew 'tmux'
brew 'reattach-to-user-namespace'
cask 'git-credential-manager'
brew 'gh'
brew 'jq'
brew 'yq'
brew 'fzf'
brew 'gsed'
brew 'gawk'
brew 'coreutils'
brew 'ripgrep'
brew 'tree'
brew 'wget'

# Programming languages
brew 'go'
brew 'node'
brew 'openjdk'

# Multimedia
brew 'imagemagick'
brew 'ffmpeg'
brew 'gifsicle'
brew 'pdftk-java'
brew 'mupdf-tools'

# Misc
brew 'grip'
brew 'minicom'
cask 'fluor'
cask 'caffeine'

# GUI applications
cask 'sketch'
cask 'omnigraffle'
cask 'affinity-designer'
cask 'gimp'
cask 'inkscape'
cask 'google-chrome'
cask 'google-drive'
cask 'libreoffice'
cask 'vlc'

# Optional tools (uncomment if not needed)
brew 'awscli'
brew 'azure-cli'
cask 'docker'
brew 'kubernetes-cli'
brew 'terraform'
cask 'android-studio'
#cask 'visual-studio-code'
